[
  {
    "title": "ECommerce Website",
    "ghLink": "https://github.com/osprey222/ecommerce",
    "short-detail": "The integration of the MERN stack ensures that my ecommerce website is highly functional, secure, and user-friendly. From browsing and searching for products to adding items to the cart, making secure payments, and tracking orders, my website provides a comprehensive and immersive online shopping solution.\n",
    "long-detail": "I have built scalable and high-performance applications, handling concurrent requests efficiently and ensuring fast response times. I have used React.js, a popular JavaScript library to  powers the frontend of my website. \nI have used Express.js, a minimalist web application framework, provides the backend infrastructure for my website.\nI have used Node.js, a powerful JavaScript runtime environment to implement server-side platform for my website. ",
    "png": "ecommerce.png",
    "gif": "ecommerce.gif"
  },
  {
    "title": "Invoice Website",
    "ghLink": "https://github.com/osprey222/fullstack-project",
    "short-detail": "I have developed the  invoice website using the powerful MERN stack.\n This website combines the best of modern technologies to provide a seamless and efficient invoicing solution.",
    "long-detail": "I have used MongoDB as the database for my website, offering a flexible and scalable solution for storing and managing invoice data. \nI have also used routing, middleware for seamless communication between the client and the server.\nWith its robust technical foundation and seamless integration of the MERN stack, our invoice website is designed to streamline your invoicing process and enhance your business operations. ",
    "png": "invoice.png",
    "gif": "invoice.gif"
  },
 {
   "title": "Timbo and Friends",
   "ghLink": "https://github.com/osprey222/Timbo-Friends",
   "short-detail": "In Timbo and Frineds, you will take control of a dynamic and agile character, sprinting through visually stunning and meticulously designed levels.\n With smooth and responsive controls, you will have full command over your character's movements, allowing you to dodge obstacles, and slide under barriers with precision and finesse.",
   "long-detail": "This is designed with mobile devices in mind, ensuring a seamless and optimized experience on the go. Whether you're playing on a smartphone or tablet, you can enjoy the game's smooth performance and responsive controls, allowing you to fully immerse yourself in the action.  I have used Sprite Renderer. Unity's built-in Sprite Renderer component is essential for rendering 2D graphics in the game.\nI have imported and manipulated sprites, apply animations, and control their positioning, scaling, and rotation within the game world.",
   "png": "runner.png",
   "gif": "runner.gif"
 },
 {
   "title": "3D Survival Game",
   "ghLink": "https://github.com/osprey222/survival-game",
   "short-detail": "I have developed a simple survival game. You can fight with monsters like the bat, rabbit and ghosts.\n The soldier's movement is good, and the bullet effect is realistic.",
   "long-detail": "I have simulated realistic physics interactions in the game.\n I have written efficient and maintainable code for implementing game logic, physics, AI, and other functionalities. I have used the physics engine to implement gravity, collisions, forces, and other physical interactions to make the game world feel more lifelike. I have utilized real-time rendering techniques, post-processing effects, lighting systems, and material shaders to create stunning and realistic visuals.",
   "png": "survival.png",
   "gif": "survival.gif"
 },
 {
   "title": "Tiny Puzzle Game",
   "ghLink": "https://github.com/osprey222/puzzle",
   "short-detail": "With its stunning visuals, immersive sound effects, and captivating gameplay, 2D puzzle game offers an unforgettable gaming experience. Whether you're a puzzle enthusiast or simply looking for a fun and challenging game, our Unity Engine-powered creation is sure to provide hours of entertainment.",
   "long-detail": "I have created and control animations for game objects.\n I have used C# as its primary programming language. C# is a versatile and object-oriented language.\nI have written  efficient and maintainable code for implementing game logic, mechanics, and interactions.",
   "png": "puzzle.png",
   "gif": "puzzle.gif"
 },
 {
   "title": "3D Tower Defence Game",
   "ghLink": "https://github.com/osprey222/Tower-Defence",
   "short-detail": "Welcome to my thrilling Tower Defense 3D game, where you will test your strategic skills against hordes of terrifying monsters.\n As the commander of a formidable army, your mission is to defend your tower from waves of wolves, and zombies that seek to destroy everything in their path.",
   "long-detail": "I have  incorporated sound effects, background music, and voiceovers into the game. I have created and designed game levels, environments, and objects in a visual interface using Unity's Scene Editor\nI have used the Unity's features such as terrain sculpting, object placement, lighting, and camera setup to implement the creation of detailed and visually appealing 3D game worlds.",
   "png": "tower-defence.png",
   "gif": "tower-defence.gif"
 }

]